[{"category": "166791", "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nDoctor Who - The Tenth Doctor's Sonic Screwdriver , New Free Shipping\n\n\n \n\n\nItem Description\n\n\n\n\nIncludes a hidden UV pen & UV light which reveals your secret writing\nButton activated lights & 'Sonic Screwdriver' sound effects\nRequires 3x AG13 Batteries (included)\nFlip open the cap at the end of the Screwdriver to reveal an additional button that activates the light and sound effects when it is in full extension OPEN mode.\nPressing the button on the side of the handle activates the LED and Sound FX which operates in CLOSED mode.\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "UT01635", "brand": "Doctor Who", "url": "http://www.ebay.com/itm/Doctor-Who-The-Tenth-Doctors-Sonic-Screwdriver-New-Free-Shipping-/261779614443?hash=item3cf347eaeb", "ebayID": "261779614443", "price": "18.40"},
{"category": "20628", "asin": ["B010NABKZK", "B0111HH0O4", "B0000CF66W"], "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nLodge L8SGP3 Pre-Seasoned Cast-Iron Square Grill Pan, 10.5-inch , New\n\n \n\n\nItem Description\n\n\nThe Lodge Cast Iron 10.25-inch square Grill Pan puts restaurant stripes on your grilled favorites like a pro. Helps with low fat cooking as the ribbed bottom pan lets you keep foods from simmering in fatty drippings. Cast-iron is a multi-functional cookware that works wonders with slow-cooking recipes and all your favorite foods. Cast iron loves a campfire, a stovetop, or an oven, and can slow-cook foods without scorching. It retains heat well so you can sear meat at higher temperatures and will keep your delicious meals warm for a long time. Whether used in a kitchen or camp, theses virtually indestructible cookware should last for generations. Made of cast iron, this cookware evenly distributes heat from the bottom through the sidewalls. Sporting a stylish black color, the cast iron grill pan looks good in most kitchens and it doubles up as an excellent source of nutritional iron. This pre-seasoned cookware is ready-to-use right out of the box. While the skillet comes pre-seasoned to prevent food from sticking, it works best when sprayed or lightly coated with vegetable oil before use. The Lodge seasoning procedure is a multiple-step process in which the seasoning oil is applied via an electrostatic spray system that coats the cookware, then its baked in commercial ovens at very high temperatures. This allows the oil to penetrate deeply into the pores of the iron. This seasoning process achieves a seasoned finish that would take many months of home use to achieve. Sometimes during this process, the seasoning oil can collect and create a bubble or slight drip at the bottom of the pan as its hanging through the production process. And that in turn can turn brown as its processed through the seasoning ovens.  This brown spot is not rust but in fact, carbonized seasoning and will darken with use.  The factory seasoning process makes Lodge cast iron products ready to use right out of the box, and the product over time Just keeps getting better. After cooking, clean with a stiff nylon brush and hot water. Using soap is not recommended, and harsh detergents should never be used. Towel dry immediately and apply a light coating of oil to utensil while it is still warm. Cast Iron, like your grandmother used, still ranks as one of the best cooking utensils ever made. It gives you a nearly non-stick surface, without the possible harmful fumes generated by preheating chemically treated nonstick cookware. The American-based company, Lodge, has been fine-tuning its construction of rugged, cast-iron cookware for more than a century.\n\n\nRibbed bottom for low-fat cooking\nPre-Seasoned and ready-to-use\nSuperior heat retention and even cooking\nUse on all cooking surfaces, grills, campfires and oven safe\nMade in the USA\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "L8SGP3", "brand": "Lodge", "upc": "075536335605", "url": "http://www.ebay.com/itm/Lodge-L8SGP3-Pre-Seasoned-Cast-Iron-Square-Grill-Pan-10-5-inch-New-/251867711804?hash=item3aa47c493c", "ebayID": "251867711804", "price": "23.89"},
{"category": "20660", "asin": ["B00EDW32X8", "B00629K4YK", "B00ZF7A0W6"], "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nArtisan (2 pk.) Non-Stick Silicone Baking Mat Set, 16 5/8 x 11 , New\n\n \n\n\nItem Description\n\n\nThe Artisan silicone 2 pack half size baking mats are ideal for use with half-sized aluminum sheet pan (18 inches x 13 inches). This mat gives your sheet pan a non-stick surface for delicate or messy baking projects. Produced using FDA (USA) and LFGB (Europe) approved materials, these are oven, microwave, and freezer safe and the silicone mats can also be used on the countertop for all types of dough. Mats clean up quickly and easily with soap and water and allow to air dry. Mats are also dishwasher approved for top rack only. The mats will not absorb food orders or flavors and are perfect for the avid baker or the seasonal holiday cook. No cooking sprays, oils or parchment paper needed, helping you save both calories and money. These will quickly become your new favorite kitchen must have item. These are not to be used as a cutting surface. Sharp objects will damage the mats. Please use in conjunction with standard baking sheet pans; place silicone baking mat inside the baking sheet and then place food/cookie dough on the top of the silicone mat for either oven or freezer use. Mats are all BPA and BPP free. Artisan Metal Works is a 107 year old company that is known for exceptionalism in the foodservice industry.\n\n\nCan be used in an oven up to 480 degrees\nFits half size baking sheets 18\" x 13\"\nFlavors or odors will not penetrate the baking mats\nEliminates the need for cooking sprays, oils, butter or parchment paper for a healthier option\nEasy to clean, just wash off with soap and water, rinse, shake off water and let air dry\nIdeal for keeping your baking sheets clean\nPerfect for cooking and candy making as well\nDurable and long lasting\nMultiple purposes and can be used for counter top work for making breads, candy and much more\nNot a cutting surface, do not use sharp objects on the mats\nFits half size baking sheets 18\" x 13\". Set includes two mats.\nSet provides outstanding heat conductivity; FDA and LFGB approved silicone. Artisan Silicone baking mats can withstand temperatures from -40 degrees Fahrenheit to 480 degrees Fahrenheit.\nEasy to clean with warm water and mild dish soap and air dry or dishwasher approved for top rack only. Artisan Silicone mats are perfect to use for in the oven, microwave or freezer.\nFlavors or odors will not penetrate the baking mats; Durable and long lasting performance, thousands of uses. Set provides outstanding heat conductivity; FDA and LFGB approved silicone.\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "671080026763", "brand": "Artisan Metal Works", "upc": "671080026763", "url": "http://www.ebay.com/itm/Artisan-2-pk-Non-Stick-Silicone-Baking-Mat-Set-16-5-8-x-11-New-/251867524704?hash=item3aa4796e60", "ebayID": "251867524704", "price": "19.49"},
{"category": "123417", "asin": ["B00C40OG22"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nCHOE UPGRADED Qi Wireless Charger Charging Pad for Galaxy S6,Nexus 6,Moto Droid \n\n\nCHOETECH QI Wireless Charger\nCHOE Qi wireless charger works with any Qi-enabled devices through a QI-compliant adapter or a QI-compliant embedded chip\nPower Source: AC Adapter with micro USB port plugs into wireless charging pad\nThe input current should not be less than 1500mA to keep high charging efficiency\nSpecifications:\nInput: DC 5V/1000mA to 2000mA\nOutput: DC 5V 1000mA (MAX)\nFrequency: 100 to 200 KHz\nWireless distance:  \nQI Charging Devices compatibility list:\n1. This Wireless Charger Pad works with fully QI-ENABLE devices .\n-Nokia Lumia 1020/920/ 928\n-HTC 8X, HTC Droid DNA, HTC Rzound, HTC Incredible 4G LTE\n-Moto Droid Turbo,Motorola Moto 360 Smart Watch ,Moto Droid Maxx, Droid Mini\n-Google Nexus 6 / 4 / 5/ 7(2013)\n-LG D1L, LG LTE2, LG G2 (Verizon),\n-Blackberry Z30 (Verizon)\n-Pentax WG-III camera\n2. It also works with device equipped with a Qi-compatible receiver:\n-Samsung Galaxy Note 4/S5/Note 3/ S4/ S3 / Note 2\n-iPhone 6/6Plus/5C/5S/5/4/4S\n-Nokia 925, Nokia 720,Nokia 820\n3. Packing details : Wireless charger  1 , USB cable  1,User manual 1\nNote:\nIncorrect place or inappropriate adapter would lead to no charging or low charging.\nIt's normal for the pad and phone get warm slightly during inductive charging, and they may get even warmer,\nif you use your phone during charging, for example using GPS or playing games, music etc.\nProtective cases that exceed 5mm / 0.2in thick prevent the charger from working and may have to be removed before wireless charging.\n2 Amps AC Adaptor is necessary (such as: Droid Maxx, Droid Mini, Nexus 4, Pentax WG-III camera etc.for more models pls contact us) and not included is this package. 2 Amps AC Adapter/Power Source needed when charing with Droid Maxx, Droid Mini, Nexus 4, Pentax WG-III camera, and other qi-enabled devices not mentioned here.Easy to use, Just put your Qi-device on the pad and comes with a Solid Blue light indicator to show charging start.Wall charger plug is not provided or required,use the wall charger that comes with you phone(1.5a above).This Wireless Charger pad ONLY works with fully QI-ENABLE devices like Nexus 4,Nexus 5,Nexus 7(2013), HTC DNA, and Lumia920. So, before you bidding on this, please make sure your Device is Qi-enabledIt will work with Samsung S5/Note 3/ Note 2/Galaxy S3/S4/iphone4/4s/5/5S with special Receiver. This package DO NOT include Receiver.\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                              \n\n\n\n\n", "mpn": "T511-000", "brand": "CHOETECH", "upc": "508939695415", "url": "http://www.ebay.com/itm/CHOE-UPGRADED-Qi-Wireless-Charger-Charging-Pad-for-Galaxy-S6-Nexus-6-Moto-Droid-/251908611871?hash=item3aa6ec5f1f", "ebayID": "251908611871", "price": "22.73"},
{"category": "20460", "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nJacquard Pearl EX Powder Pigments (32-Color Set) , New Free Shipping\n\n\n \n\n\nItem Description\n\n\nThis set includes 3 gram jars of: Metallics-650 Micropearl 651 Pearlwhite 652 Macropearl 653 Red-Russet 654 Super-Russet 655 Super-Copper 656 Brilliant Gold 657 Sparkle Gold 658 Aztec Gold 659 Antique Gold 660 Antique Bronze 661 Antique Copper 662 Antique Silver 663 Bright Yellow 684 Flamingo Pink 685 Sprin green 686 Turquoise 687 True Blue 688 Misty Lavender 689 Blue Russet 690 Sparkling Copper. Duo colors-680 Red/Blue 681 Blue/Green 682 Green/Yellow. Interference Colors-670 Red 671 Blue 672 Green 673 Violet and 674 Gold.\n\n\nSafe, pearlescent, non-toxic Pearl EX Powdered Pigments are Jacquard's most versatile product\nUse these beautiful powdered pigments on fabric, paper, shrink plastic, polymer clay, leather, glass, wood and more\nPearl EX creates a metallic look without being a metal, and it will not tarnish or fade\nNot for cosmetic use; made in the USA\nFor over 30 years, Jacquard has been the leading manufacturer of artist quality textile, mixed media and craft products\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "273019", "brand": "Jacquard", "url": "http://www.ebay.com/itm/Jacquard-Pearl-EX-Powder-Pigments-32-Color-Set-New-Free-Shipping-/261778215845?hash=item3cf33293a5", "ebayID": "261778215845", "price": "45.49"},
{"category": "30109", "asin": ["B000UIPP3O"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nClub Champ Golf Bag Travel Cover\n\n\nThe Club Champ Golf Travel Cover is a must have if you a planning some summer travel with your clubs. This Club Champ Golf Bag Travel Cover has built in wheels and extra padding on top to make sure they are well protected.Makes traveling with your clubs easierBuilt in wheels eliminate back strainHeavy duty constructionExtra padding on topFull size and fully collapsible\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                              \n\n\n\n\n", "mpn": "9717", "brand": "Club Champ", "upc": "087705097177", "url": "http://www.ebay.com/itm/Club-Champ-Golf-Bag-Travel-Cover-/261836099248?hash=item3cf6a5ceb0", "ebayID": "261836099248", "price": "35.18"},
{"category": "180349", "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\n15 Standard Wooden Chess Set , New Free shipping\n\n\n \n\n\nItem Description\n\n\nThis classy, convenient chess set makes a great gift. Board measures 15\" x 15\". King measures 3 1/4\" tall. Board is foldable with a latch for easy storage.\n\n\nFoldable board\nClassic game\nQuality construction\nFrom CHH Imports\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "CHH_2146", "brand": "CHH", "url": "http://www.ebay.com/itm/15-Standard-Wooden-Chess-Set-New-Free-shipping-/261779609200?hash=item3cf347d670", "ebayID": "15", "price": "13.10"},
{"category": "46692", "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nApache AL13P Professional Hot/Cold 13 A3 4 Thermal Laminator for Documents and P\n\n\nThe Apache AL13P is an A3 class laminator capable of laminating items up to 13\" wide, specifically standard 8 12 x 11\" sheets of paper sideways and items up to 13\" wide for quick, clear, and bubble-free results. The AL13P is made of heavy-duty steel, has a professional grade motor, professional grade heating elements, 4 silicone rollers, and the ability to laminate in cold mode. The unit weighs 16 lbs. and has a thick metal base to reduce vibrations during the lamination process, resulting in consistently high quality end products with secure seals. The AL13P is designed for long-term use and professional laminating projects. The AL13P is ideal for protecting documents and photos from wear, tear, liquids, and humidity. Lamination also helps to preserve and enhance presentation documents. \n The AL13P's temperature is fully adjustable for a variety of materials and pouches. The AL13P comes with a 20 pack of 5 and 3 mil laminator pouches and a 1 year manufacture warranty. \n Apache offers 9\" and 13\" light-duty laminators as part of the home series. Search for Apache AL9 and AL13 on Amazon. For larger professional laminators, Apache sells 13\" and 18\" professional laminators as well. Search for Apache AL13P and AL18P on Amazon.Heavy Duty Steel Construction Throughout (16 lbs.)Professional Grade Motor and Heating Element13\" Laminating Width and 4 Silicone RollersPrecise Temperature Control and Forward/Reverse SwitchISO9002 Designation and Includes a 20 pack of 5 and 3 mil Laminator Pouches\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                              \n\n\n\n\n", "mpn": "AL13P", "brand": "Apache", "url": "http://www.ebay.com/itm/Apache-AL13P-Professional-Hot-Cold-13-A3-4-Thermal-Laminator-for-Documents-and-P-/261836068756?hash=item3cf6a55794", "ebayID": "261836068756", "price": "104.71"},
{"category": "82161", "asin": ["B00NARUU3M"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\niPhone 6 Case, Black With [Tempered Glass Screen = Best LCD Protector] [Patented\n\n\nSlim Phone 6 Case + Maximum LCD Protection + Amazing Design = Best iPhone Case Ever Built \n TEMPERED GLASS PROTECTIVE SCREEN - The shatterproof screen cover provides scratch and breakage protection for the Apple iPhone 6 LCD screen and is touch sensitive, so you can still use your phone with ease. \nSTYLISH, COOL iPHONE CASES - Stylish modern design gives your smartphone a distinctive look and is ultra slim for easy, comfortable carrying. \nKEEPS YOUR PHONE FULLY FUNCTIONAL - You can access every button and port with ease without having to remove your iPhone 6 case. \nTAKE PHOTOS LIKE A PRO - Sahara cases are the only iPhone 6 cases with our revolutionary lens hood that works with the flash of the Apple iPhone 6. In laboratory tests, the lens hood was shown to greatly improve the color of images for impressive results. \nINCREDIBLY DURABLE - We combine a durable hard plastic skeleton for strength with shock-absorbing TPU edges. This shields your phone from the front, sides and back. \nStunningly modern and completely shatterproof, the Sahara is the slimmest, strongest phone case available for the Apple iPhone 6. \nThe Only Case that's as Beautiful as the iPhone\nThe sexy, slim design makes Sahara cases the best iPhone cases for those who want a compact, go-anywhere protection solution. The Sahara is inspired by the mystery of the Sahara desert and is distinctly crafted to create truly cool iPhone cases with distinctive, modern style. The Sahara Case iPhone 6 Case Includes a Tempered Glass Sensitive Touch Screen Protector for Maximum Protection of Your iPhone 6 and its LCD.Stunning Slim Design with Heavy Duty ProtectionCompatable with Apple iPhone 6 4.7\" inch EditionEasy Access Button Design with Durable Hard Plastic Skeleton and Shock Absorbing TPU EdgesRevolutionary Lens Hood Design that Improved Image Colors in Laboratory Testing\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                                \n\n\n\n\n", "mpn": "i6Black", "brand": "Sahara Case", "upc": "633926931600", "url": "http://www.ebay.com/itm/iPhone-6-Case-Black-With-Tempered-Glass-Screen-Best-LCD-Protector-Patented-/251896506275?hash=item3aa633a7a3", "ebayID": "251896506275", "price": "26.31"},
{"category": "22700", "asin": ["B0063GT330"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nFrankford Arsenal Corn Cob Brass Cleaning Media Bag, 15-Pound\n\n\nFrankford Arsenal Corn Cob Brass Cleaning Media has been designed to quickly and efficiently remove dirt, grit and powder residue from brass cases before reloading to keep reloading dies in top working condition. Media can be used repeatedly, but should be replaced periodically for optimum performance.15 lb. bag of Frankford Arsenal Corn Cob Brass Cleaning MediaUntreated corn cob mediaMedia can be reused, but should be replaced periodically for best performance\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                              \n\n\n\n\n", "mpn": "446063", "brand": "Frankford Arsenal", "upc": "661120460633", "url": "http://www.ebay.com/itm/Frankford-Arsenal-Corn-Cob-Brass-Cleaning-Media-Bag-15-Pound-/261836379755?hash=item3cf6aa166b", "ebayID": "261836379755", "price": "27.61"},
{"category": "280", "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nMTM Tactical Mag Can for 223/5.56 Magazine Storage TMC15\n\n\nMTM TMC15 Tactical Mag Can is always ready for quick transport. It offers a protected method of storage for loaded magazines. Each mag is individually secured (in an upright position) with ridged foam padding to prevent bumping, sliding and scratching. The box shuts tight with an O-ring seal and solid latching system. The strong comfortable handle holds firm with a fully loaded box, then folds flat for stackable storage. Tabbed for two padlocks, Tactical Gun owners can rest assured knowing their cache is protected inside the MTM Tactical Mag Can. Color: Dark Earth. Outside Dimensions: 8.75\" (L) x 15.5\" (W) x 9\" (H).Water-resistant O-ring seal; Heavy-duty, latching systemRidged foam paddingDouble padlock tabbedMolded-in stacking ridges; Outside Dimensions: 8.75\" (L) x 15.5\" (W) x 9\" (H)Made in USA\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                                \n\n\n\n\n", "mpn": "TMC15", "brand": "MTM", "url": "http://www.ebay.com/itm/MTM-Tactical-Mag-Can-for-223-5-56-Magazine-Storage-TMC15-/261836022342?hash=item3cf6a4a246", "ebayID": "261836022342", "price": "26.30"},
{"category": "139973", "asin": ["B00CJ7IUIQ"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nThe Elder Scrolls V: Skyrim Legendary Edition - PC\n\n\nWinner of more than 200 Game of the Year awards, experience the complete Skyrim collection with The Elder Scrolls V: Skyrim Legendary Edition, including the original critically-acclaimed game, official add-ons  Dawnguard, Hearthfire, and Dragonborn  and added features like combat cameras, mounted combat, Legendary difficulty mode for hardcore players, and Legendary skills  enabling you to master every perk and level up your skills infinitely.Live Another Life, In Another World: Play any type of character you can imagine, and do whatever you want; the freedom of choice, storytelling, and adventure of The Elder Scrolls comes to life in one legendary experience from all three official add-ons.Dawnguard: The Vampire Lord Harkon has returned to power. By using the Elder Scrolls, he seeks to do the unthinkable - to end the sun itself. Will you join the ancient order of the Dawnguard and stop him? Or will you become a Vampire Lord?Hearthfire: Purchase land and build your own home from the ground up - from a simple one-room cottage to a sprawling compound complete with an armory, alchemy laboratory, and more.Dragonborn: Journey off the coast of Morrowind, to the vast island of Solstheim. Traverse the ash wastes and glacial valleys of this new land as you become more powerful with shouts that bend the will of your enemies and even tame dragons.\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                                \n\n\n\n\n", "mpn": "11899", "brand": "Bethesda", "upc": "069060179835", "url": "http://www.ebay.com/itm/The-Elder-Scrolls-V-Skyrim-Legendary-Edition-PC-/251903626209?hash=item3aa6a04be1", "ebayID": "251903626209", "price": "23.39"},
{"category": "20684", "asin": ["B0063PKOL6"], "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nMAVEA 105731 Maxtra 6-Pack Replacement Filter for MAVEA Water Filtration Pitcher\n\n \n\n\nItem Description\n\n\n     MAVEA is the new generation of water filtration from Germany, bringing a new line of filters and systems to North America.   The Maxtra filter is a next-generation filter used in MAVEA Elemaris and Marella systems, as well as Tassimo brewing systems. Clean. Filter micro-screen reduces release of carbon particles into water. Fast. No pre-soaking to activate filters. The filter is steam sterilized and then vacuum-sealed to maintain its ready-to-use condition. Safe*. Contains silver to provide antimicrobial protection and extend filter life. BPA Free. All filter system components are made from BPA Free materials and certified safe for use with drinking water. Consistent. Unique shape delivers consistent performance over the life of the filter. * This product does not protect individuals from bacteria, viruses and other disease organisms      EVOLUTION OF THE FILTER MAVEA has introduced a new line of advanced pour through pitcher filter systems and filters that have a numerous advanced design features to make your filtered water  experience significanty better. These are our Elemaris and Marella pitchers and MAVEA Maxtra filters.    WQAcertified to significantly reduce chlorine and other unwanted elements  How does the MAVEA filtration system work?New generation of filter technology that is certified by the Water Quality Association to  NSF standards 42 and 53 to reduce:  Chlorine taste and odor Heavy Metals (mercury, cadmium, copper) Agricultural Chemicals (atrazine, simazine) Industrial Pollutants (benzene, tetrachloroethylene)     Optimal mixture of activated carbon and ion exchange resin beads that work together to improve water taste and reduce contaminants   Activated Carbon - absorbs chlorine and organic compounds like chemicals and pesticides Ion Exchange Beads  capture heavy metals and  reduce water hardness Silverized - The filter media is silverized to inhibit  the growth of bacteria to maximize the filter life     85% of all households have hard drinking water! To dramatically see and taste the difference between regular tap water and water filtered by MAVEA, try the MAVEA tea test. Make two cups of tea (the higher the quality of the tea, the more youll notice the difference in your results). One cup with straight tap water and the other with MAVEA filtered water. Then look at the two teas. Youll notice that the MAVEA tea is a clearer, more translucent, appetizing amber color. Next, taste them. The MAVEA tea will taste better. Youll notice the flavor and even the aroma of the tea is crisper and more perceptible.   MAVEA MAXTRA Filters are featured in select high-end Tassimo brewers Only Tassimo can make coffees, espressos, cappuccinos, lattes, tea, hot chocolate and iced beverages in about 1 minute at the touch of one button - MAVEA ensures exceptional flavor every time and can help prolong the life of other kitchen appliances including electric kettles, pressure cookers and cookware.  Sustainable: Each MAXTRA filter replaces three hundred 500-ml bottles. We are also the only company that supports its filters with a comprehensive filter take-back and recycling program. Every part is reused. Nothing goes to the landfill. You can bring your used filter to recycling bins in stores or just mail them back to us at our expense.   CERTIFIED TO REDUCE:  Chlorine taste and odor Industrial pollutants (benzene, tetrachloroethylene) Heavy metals (mercury, cadmium, copper) Agricultural chemicals (atrazine, simazine) Limescale*  * Limescale reduction certified in internal tests, not certified by WQA.   What are the benefits of MAVEA filtered water?  85% of all households have hard tap water. While safe to drink, this water may contain substances that affect its taste, smell appearance and overall quality. MAVEA filtered water significantly reduces chlorine taste and odor, making you drinking water clearer and refreshingly delicious. MAVEA filtered water also improves the taste of coffee, tea and concentrated beverages!  Even your ice cubes look and taste better! Plus, Mavea filtered water can increase the life span of domestic appliances by reducing limescale build up.    Who is MAVEA? MAVEA is a subsidiary of the worlds leading water filtration company that invented the category 45 years ago in Germany. Today, we serve millions of consumers worldwide, but water remains our only passion and business. MAVEA products were introduced to North America in 2009 to offer consumers premium water filtration experiences. NEW GENERATION: the unique new shape of the Maxtra filter delivers consistent filter flow rate over the life of the filterCLEAN: filter micro-screen reduces release of carbon particle black bits into systemFAST: no pre-soaking required to activate filter, saving 20 minutes for filter exchangeSAFE: contains silver to provide antimicrobial protection and extend filter life; BPA FREESUSTAINABLE: MAVEA offers a comprehensive filter take-back and recycling program; simply download a shipment label and drop filters in the mail\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://www.ebay.com/itm/MAVEA-105731-Maxtra-6-Pack-Replacement-Filter-for-MAVEA-Water-Filtration-Pitcher-/251868890515?hash=item3aa48e4593", "brand": "Mavea", "upc": "812501010644", "ebayID": "251868890515", "price": "35.82"},
{"category": "82161", "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\niPhone 6 Plus Case, Spigen [STAND FEATURE] Slim Armor Case for iPhone 6 Plus (5.\n\n\nSpigen iPhone 6 (5.5\") \"Slim Armor\".Matte TPU + Polycarbonate = Dual Layer ProtectionAdvanced Shock Absorption Technology: Web Pattern TPU CaseLay on the table design: 0.6mm lip to protect the screenBuilt in Kick-Stand for Hands-Free ViewingSlim and Minimalistic Style with Curved Sides for a Comfortable GripiPhone 6 Plus Case Compatible with Apple iPhone 6 Plus (5.5\") - 2014\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                              \n\n\n\n\n\n", "mpn": "SGP10905", "brand": "Spigen", "url": "http://www.ebay.com/itm/iPhone-6-Plus-Case-Spigen-STAND-FEATURE-Slim-Armor-Case-for-iPhone-6-Plus-5-/251944454425?hash=item3aa90f4919", "ebayID": "251944454425", "price": "20.46"},
{"category": "16515", "asin": ["B003621UT4"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nLittle Tikes 2-in-1 Snug 'n Secure Swing Blue\n\n\nLittle Tikes 2-in-1 Snug Secure Swing The Little Tikes 2-in-1 Snug Secure Swing is for children who absolutely love to swing.  This baby swing from Little Tikes is the perfect combination of safety and comfort.  Caring parents will love all of the different safety features found on the Little Tikes swing. The Snug Secure Swing from Little Tikes grows with the child from baby to toddler.  Parents will love that the Little Tikes Swing boasts greater value because of the extended use they get out of it.  It is a durable outdoor toy which has great safety features like a T-bar.  The bar rotates down for easy loading and unloading of the child.  The shoulder straps on the baby swing from Little Tikes are adjustable and help secure the baby in place.  It also prevents the baby from tipping forward.  This baby swing from Little Tikes grows right along with the child and allows the parent to remove the T-bar and straps when the child can sit on the bottom of the baby swing on his/her own.  This Little Tikes swing is for a child 9 months to 4 years.Easy-in hinged T-barStay-put shoulder straps hold baby securely in placeAs the child grows and doesn't require the T-bar or straps, they store conveniently out of the wayDurable and great for outdoor or indoor swingMade in USA\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                              \n\n\n\n\n\n", "mpn": "617973M", "brand": "Little Tikes", "upc": "050743600937", "url": "http://www.ebay.com/itm/Little-Tikes-2-in-1-Snug-n-Secure-Swing-Blue-/261874222906?hash=item3cf8eb873a", "ebayID": "261874222906", "price": "25.88"},
{"category": "79682", "asin": ["B0026T0LB6"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nEarth Heavy Duty VIP Tall Aluminum Director's Chair\n\n\nEarth Heavy Duty VIP Tall Directors Chair w/Foot Rests and Side Storage Bag - Built Larger and Stronger!Larger Size, Much Stronger-- More RoomExtra Heavy-Duty, w/ Wider TubingReinforced Aluminum Frame w/ 8-Points ofTwo Layers of 600D Fabric for Extra Strength, also Fabric is Stain ResistantComfortable High Back & Foot Rests\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                              \n\n\n\n\n", "mpn": "EP18T", "brand": "Earth", "upc": "837654403198", "url": "http://www.ebay.com/itm/Earth-Heavy-Duty-VIP-Tall-Aluminum-Directors-Chair-/261836069141?hash=item3cf6a55915", "ebayID": "261836069141", "price": "104.99"},
{"category": "137084", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... STILL HAS TAGSZipper is BROKEN. Needs Replacement.Please see PhotosGift Rating (see below): AThis ultra-soft and lightweight Canari Arizona Classic cycling jersey for men provides a fantastic feel and a colorfully confident look for your ride. Breathable mesh material keeps you cool, dry and refreshed, while three pockets on the back offer sweet storage for your phone, keys, or other essentials.Features100% polyesterSoft, lightweight and breathable constructionFull-zip frontRaglan sleevesThree back pocketsArizona graphicsModel: 12232Made in ChinaShipping: Economy shipping is listed.   We will ship the product as effeciently as possible.  We preferUSPS but will ship via FedEx Smartpost, FedEx Ground and UPS as well.  If you need delivery to meet a schedule, PLEASE LET US KNOW.   We can always negotiate for an appropriate shipping means through the offer channel.   Sometimes it is only a few dollars different between economy and USPS Priority.   We will work with you on shipping.RETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\n\n\n", "url": "http://www.ebay.com/itm/Canari-Mens-Arizona-Classic-Full-Zip-Short-Sleeve-Cycling-Jersey-/111717046572?hash=item1a02dad92c", "brand": "Canari", "ebayID": "111717046572", "price": "not_set"},
{"category": "73362", "asin": ["B00BAQKRHY"], "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nNite Ize STCK-11-R8 Steelie Car Mount Kit for Cellphones - Retail Packaging\n\n \n\n\nItem Description\n\n\nHere's how it works: two specially engineered components - the Steelie Magnetic Phone Socket and Steelie Ball Mount - are backed with 3M VHB foam adhesive tape, to provide secure-yet-versatile phone docking exactly where you need it. The Steelie Magnetic Phone Socket Component is a strong, machined aluminum base containing a powerful, circular magnet centered with flexible silicon that attaches to the center of the back of your phone or hard case. The Steelie Ball Mount Component also features a machined aluminum base topped with a steel ball that can be attached anywhere on your dashboard. The two connect magnetically, and, once your phone is in place, keep it securely positioned, even if you accidentally hit that speed bump a little faster than you intended. The Steelie Magnetic Phone Socket's silicon center creates a smooth glide and firm grip, so you can easily rotate the phone from landscape to portrait position and it stays that way until you turn it again. And, because of its fumble-free design, unlike other phone holders, the Nite Ize Steelie Car Mount Kit is legal in all 50 United States. Here's an added bonus: when you've reached your destination and you detach your phone from the Ball Mount, the Magnetic Phone Socket still works with any other convenient metal surface. So you can attach your phone to refrigerator doors, metal shelving, filing cabinets, toolbox tops, even grocery cart handles-and keep it usable, secure, and easy to view throughout your day. The Steelie Magnetic Phone Socket contains a strong magnet. These magnets will NOT damage your tablet or phone. However, do not place new magnetically sensitive objects such as credit cards, pacemakers or computer hard drives. Steelie assumes no liability for damage to such objects.The Steelie Car Mount Kit allows secure attachment for any mobile device, with or without a rigid case, to any vehicle dash with unlimited viewing angles.Each Steelie Car Mount Kit includes one Steelie Magnetic Phone Socket, one Steelie Ball Mount, an alcohol prep pad, 3M primer, and installation instructions.Steelie Magnetic Phone Socket features a powerful neodymium magnet and silicon center to provide a strong grip and smooth glide. The neodymium magnet is safe for use with all phones and tablets.Features 3M Primer. We recommend it be used when attaching the Ball Mount Component to a vinyl vehicle dash to create a durable bond.\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "STCK-11-R8", "brand": "Nite Ize", "upc": "163120910946", "url": "http://www.ebay.com/itm/Nite-Ize-STCK-11-R8-Steelie-Car-Mount-Kit-for-Cellphones-Retail-Packaging-/261822511824?hash=item3cf5d67ad0", "ebayID": "261822511824", "price": "20.46"},
{"category": "80914", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Believed to be new and unusedActual use is Undetermined Please see PhotosGift Rating (see below): ARubie's Monster High Rochelle Goyle Costume/Dress up/Pretend PlaySize medium (8-10, ages 5-7). Includes dress, wings.Officially licensed Monster High costumeCostume is in new condition in retail plastic. Retails for $40.This Rochelle Goyle Costume for Girls includes dress with attached petticoat and wings. The adorable black and white top is made of comfortable polyester and has crossing shoulder straps. Falling from the waist is the black and white skirt printed with bows, fleur de lis, and chandeliers. Peaking out from beneath the skirt is the black petticoat, which will give your dress some bounce while you walk to Home Ick. Completing the outfit are the large stone-gray wings covered with silver speckles. Shipping: Economy shipping is listed.   We will ship the product as effeciently as possible.  We preferUSPS but will ship via FedEx Smartpost, FedEx Ground and UPS as well.  If you need delivery to meet a schedule, PLEASE LET US KNOW.   We can always negotiate for an appropriate shipping means through the offer channel.   Sometimes it is only a few dollars different between economy and USPS Priority.   We will work with you on shipping.RETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\nFroo www.froo.com | Froo Cross Sell, Free Cross Sell, Cross promote, eBay Marketing, eBay listing Apps, eBay Apps, eBay Application\n\n\n\n\n", "url": "http://www.ebay.com/itm/NEW-RUBIES-MONSTER-HIGH-ROCHELLE-GOYLE-Child-Girls-Costume-Dress-up-M-8-10-/121548348239?hash=item1c4cd89b4f", "brand": "Rubie's", "ebayID": "121548348239", "price": "not_set"},
{"category": "42255", "asin": ["B008LHE2HQ", "B00IOXK8RK", "B002JWSNIS", "B00QZLVVOW", "B00QXDL0TI"], "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nDEWALT DW2166 45-Piece Screwdriving Set\n\n \n\n\nItem Description\n\n\nIncludes 45-Piece Screwdriving Bit Set - DW2166, Tough Case45 screwdriving set\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "DW2166", "brand": "DEWALT", "upc": "028877528144", "url": "http://www.ebay.com/itm/DEWALT-DW2166-45-Piece-Screwdriving-Set-/251868902023?hash=item3aa48e7287", "ebayID": "251868902023", "price": "17.82"},
{"category": "47356", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Appears new and unused .. has tags attachedO'Neil WetsuitsWomens Basic Short Sleeve Crew Rash Guard ShirtLight AquaXSMALLVery nice shirtABOUT FSB SERVICES:\nAfter finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount.  The items we have are Open Box Store Returns.   This means for the most part someone purchased the item and took it home.  For some reason they decided to return the item.  The reasons very greatly ..  for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken.   We endeavor to make sure what we are selling you is not broken.  If there is a blemish we endeavor to make that blemish clear.  If your items must be perfect, we suggest you purchase your items from Macys or Sears.  If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us.  If something slipped by in our QC process, please let us know.  Our intent is for a WIN-WIN.  You receive a product at a nice discount and we make some money to help our families.\n\nTo Help reduce costs and save our environment.  Your product will most likely arrive in \"re-purposed\" packaging.  \n\nFroo www.froo.com | Froo Cross Sell, Free Cross Sell, Cross promote, eBay Marketing, eBay listing Apps, eBay Apps, eBay Application\n\n\n\n\n", "url": "http://www.ebay.com/itm/ONeill-Wetsuits-Womens-Basic-Skins-Short-Sleeve-T-Shirt-Size-X-Small-/111498549678?hash=item19f5d4d9ae", "brand": "O'Neill", "ebayID": "111498549678", "price": "not_set"},
{"category": "20684", "asin": ["B00007E848"], "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nPUR 2-Stage Water Pitcher Replacement Filter, 4-Pack , New Free Shipping\n\n \n \n\n\nItem Description\n\n\nFrom the Manufacturer Tap water may look clean, but it may still contain potentially harmful contaminants. Chlorine is a type of disinfectant added to water to control microbes, yet harmful by-products can form from chlorine, such as total trihalomethanes (TTHMs). Depending on the geographic area, water can also be contaminated with everything from industrial and agricultural pollutants to heavy metals, sediments, and trace levels of pharmaceuticals. The PUR 2-Stage Water Pitcher Filter reduces lead, 99.9 percent of microbiological cysts (cryptosporidium and giardia), and can remove over 96% of trace levels of pharmaceuticals--all while retaining the beneficial fluoride in drinking water. The 2-Stage design has an activated carbon microfilter layer to reduce sediment, chlorine taste and odor, chlorination by-products like TTHMs, and agricultural and industrial pollutants. An additional layer is added to trap sediment.\nA single filter provides up to 40 gallons (1 to 2 months) of clean water, and should be replaced after this period. Available in 1-, 2-, 3-, and 4-Packs, this replacement filter is meant for use only with the PUR 2-Stage Water Pitcher and Dispenser.\n\n\n\n\n\n\n\n Our patented, premium carbon filter makes PUR the first leading pitcher filter that removes 99% of microbial cysts. It also reduces chlorine (taste and odor) and 96% of trace levels of pharmaceuticals, giving you clean, great-tasting water. Yet it still leaves behind beneficial fluoride.  Pharmaceutical reduction is not certified by NSF/ANSI or state standard. Based on manufacturer testing for average reduction in trace levels of 12 pharmaceuticals. May not be present in all users water. \"If air pockets become trapped within the filter, this can prohibit or slow down water flow considerably. To remedy this, we would suggest a secondary 15 minute soak of the filter. Once complete, shake the filter while it is submerged to remove any remaining air pockets or bubbles within the filter. After this, turn the filter upright and gently tap it against the sink to compact the contents of the filter. This should help restore proper water flow.\n\n \nProduct Features\n Removes 2x more contaminants than the leading pitcher filter 1 Provides 40 gallons or up to 2 months of clean filtered water per filter.\n\n \n \nCompare\n\n\n\n\n\nProduct Type\n\n\nAdvanced MineralClearTM Faucet Mounts\n \n\n\nBasic ClassicClearTM Faucet Mounts\n \n\n\nPitchers and Dispenser\n\n\n\n\nProduct Options\nPUR Horizontal MountPUR Vertical MountPUR Flavor Options\nPUR Faucet Mounts\n\nPUR 18 cup DispenserPUR PitcherPUR Flavor Options Pitcher\n\n\n\nCorresponding Filter\nMineralClearTM Faucet MountFilter RF-9999\nClassicClearTM Faucet Mount Filter RF-3375\nPitcherFilter CRF-950Z\n\n\nNo Refilling Required\n\n\n \n\n\nEstimated Filter Life\n3 months\n3 months\n2 months\n\n\nWater Filtered per Filter\n100 gallons\n100 gallons\n40 gallons\n\n\nLeaves Fluoride in Water\n\n\n\n\n\nFilters Over Natural Minerals2\n\n \n \n\n\nContaminants Reducedper NSF certification\n61\n61\n14\n\n\n\n \n\n\n\nPackage includes 4 filters for use with the PUR 2-Stage Water Pitcher and Dispenser\nReduces lead, 99.9 percent of microbiological cysts, and over 96% trace levels of pharmaceuticals while retaining beneficial fluoride\n2-Stage design with activated carbon microfilter layer to reduce contaminants and a layer to trap sediment\nSingle filter provides up to 40 gallons (1 to 2 months) of clean water and should be replaced after this period\nAvailable in 1-, 2-, 3-, and 4-Packs\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "æ\u009a\u0082æ\u0097", "brand": "PUR", "upc": "723987713243", "url": "http://www.ebay.com/itm/PUR-2-Stage-Water-Pitcher-Replacement-Filter-4-Pack-New-Free-Shipping-/261801810373?hash=item3cf49a99c5", "ebayID": "261801810373", "price": "25.11"},
{"category": "3273", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Gift Rating (see below): AMade in ItalySet of 6 shot glasses measuring 1-3/4 by 1-3/4 by 3-1/2 inches and holding 2 ounces eachSilky, clear-glass construction with gently flared profilesClassic European design marked by chunky, solid-glass basesSafe for use in the dishwasher; made in ItalySleek and stylish addition to in-home bar collectionsRETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\n\n\n", "mpn": "168169B79021990", "brand": "Bormioli Rocco", "url": "http://www.ebay.com/itm/Bormioli-Rocco-Party-Dublino-Shot-Glasses-Clear-Set-of-6-/121669892380?pt=LH_DefaultDomain_0&hash=item1c5417391c", "ebayID": "121669892380", "price": "not_set"},
{"category": "43513", "asin": ["B00ORC2Z2S"], "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nPureSteam Portable Fabric Steamer - Fast-Heating, Handheld Design Perfect for Ho\n\n \n\n\nItem Description\n\n\nFall in love with your clothes again with Pure Enrichment's PureSteam Portable Fabric Steamer. Unlike the chore of ironing, our small but mighty portable garment steamer makes wrinkle-busting a quick and fun activity you will look forward to doing. PureSteam's fast-heating water tank is ready to go within two minutes and provides 10 minutes of non-stop steaming making it an easy and convenient way to make a great impression at work, on the go, or at a special event. PureSteam's portable design and 8 foot cord also makes it the perfect tool for reviving wrinkled household furniture upholstery and drapes while still on the rod. \n\n From air care and relaxation to personal care and purification systems, all Pure Enrichment products are meticulously crafted to meet the highest design and quality standards. PureSteam is backed by Pure Enrichment's industry-leading 2 Year Warranty.New nozzle design distributes steam powerfully and consistently to remove stubborn wrinkles from clothing, drapery, furniture upholstery, bedding and table linens - Safe to use on all types of fabric8 foot built-in 2-prong cable removes the need for an extension cord - 110V (North America model)Compact design travels and stores easily - Includes auto shut-off safety protection if the unit gets too hot or too low on waterHeats quickly to emit wrinkle-busting steam in 2 minutes - High-capacity, easy-fill water tank lasts for 10 minutes of continuous steaming2 Year Warranty - Your satisfaction is guaranteed!\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "PEMINISTM", "brand": "Pure Enrichment", "upc": "728028308891", "url": "http://www.ebay.com/itm/PureSteam-Portable-Fabric-Steamer-Fast-Heating-Handheld-Design-Perfect-for-Ho-/251868889196?hash=item3aa48e406c", "ebayID": "251868889196", "price": "35.82"},
{"category": "35190", "asin": ["B00Q3G8LPQ"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nCar Mount, iOttie iTap Magnetic Air Vent Mount for iPhone 6/6 Plus/5s/5c, Galaxy\n\n\nThe iOttie iTap Magnetic Vent Mount is a new sophisticated yet fully functional mounting solution that provides a strong grip to smartphones using a magnetic hold. Utilizing an aluminum bezel, the iTap Magnetic Vent Mount is not only built with great quality but also gives off a neat contemporary look to make it stand out from the rest. It will now give users a new mounting option (instead of on the dashboard or windshield). Unlike most vent mounts, the iTap Magnetic Vent Mount was designed to allow for full 360 degree rotation, thus providing the user with a better viewing angle. It provides a unique One Click lock and release feature with silicon placed on the connecting arms to provide a safe latch to the users vent to avoid scratching/damage while also minimizing vibrations to the device when in use. With 6 rare earth magnets included providing a powerful grip from mount to smartphone, the user can feel the powerful grip once they place the magnet close to the mount. The iTap Magnetic Vent Mount accommodates most smartphones as well as their cases by using the provided metal plate. It is more compact than most vent mounts in the market which provides for a cleaner, organized look. Simply attach the magnetic plate to your smartphone, mount with one hand and go. Please Note: The magnet should not cause interruption to your smartphone and or internet quality when in use, however, it may cause some interference to select smartphones compass function. Please note the compass will return back to normal after removing the smartphone from the mountA universal mounting solution that will hold most smartphones, as well as their cases, and GPS devicesProvides a choice of an inner and outer metal plate; each plate uses an adhesive tape to attach to select mounting location and is easily removable. 6 Rare Earth Magnets provides a 6lb pull force to give users a strong grip.Spring loaded one click lock and release feature to provide a strong clamped hold to users vent blade while also minimizing vibrations to your device.Small and compact with a sophisticated design. Provides 360 viewing angles using a pivot joint to give the user an enhanced view of their device.The magnet should not cause interruption to your smartphone's internet, cellular, or navigation quality when in use. It may cause some temporary interference to select smartphones compass function depending on the location of mounting the magnet mount. The compass will return back to normal use after removal. The metal plate may cause interference to Qi charging functions, once the metal plate is removed, QI charging will return back to normal.\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                              \n\n\n\n\n\n", "mpn": "HLCRIO151", "brand": "iOttie", "upc": "859301003179", "url": "http://www.ebay.com/itm/Car-Mount-iOttie-iTap-Magnetic-Air-Vent-Mount-for-iPhone-6-6-Plus-5s-5c-Galaxy-/261874305046?hash=item3cf8ecc816", "ebayID": "261874305046", "price": "29.82"},
{"category": "37644", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Believed to be new and unusedActual use is Undetermined Please see PhotosGift Rating (see below): AYour bed may be for sleeping, but it is also the major focal point of your bedroom. You want to ensure that your bed portrays the magnificence and beauty you desire in your home's fashion.With this set you will get a gorgeous duvet cover and 2 matching pillow shams that will dress up your bed without breaking the bank. In comfortable materials, this set is going to ensure your room is fashionably decorated and ready to show off!Features:3-piece set includes duvet cover and 2 pillow shamsMaterial: 100% polyesterMachine washable for easy caseComfortable and fashionableKing:Duvet cover measures 104\" L x 90\" WShams measure 20\" L x 36\" WShipping: Economy shipping is listed.   We will ship the product as effeciently as possible.  We preferUSPS but will ship via FedEx Smartpost, FedEx Ground and UPS as well.  If you need delivery to meet a schedule, PLEASE LET US KNOW.   We can always negotiate for an appropriate shipping means through the offer channel.   Sometimes it is only a few dollars different between economy and USPS Priority.   We will work with you on shipping.RETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\nFroo www.froo.com | Froo Cross Sell, Free Cross Sell, Cross promote, eBay Marketing, eBay listing Apps, eBay Apps, eBay Application\n\n\n\n\n", "url": "http://www.ebay.com/itm/1500-Series-Egyptian-Quality-3pc-Duvet-Cover-Set-King-White-/111583206016?hash=item19fae09a80", "brand": "Sweet Home Collection", "ebayID": "1500", "price": "not_set"},
{"category": "20318", "asin": ["B008LTBJFM"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nCrucial 8GB Kit (4GB x 2) DDR3/DDR3L-1066 MT/s (PC3-8500) CL7 204-Pin SODIMM Mem\n\n\nCT2C4G3S1067M is an 8 GB kit consisting of (2) 4 GB DDR3 Notebook modules that operates at speeds up to 1066 MT/s and has a CL7 latency. It is Unbuffered and is non-ECC. It conforms to the industry standard SODIMM layout of 204-Pins and is compatible with computers that take DDR3 SODIMM memory.Increases system performanceCompatible with select Mac systemsAll memory stick modules extensively tested at the component and function levelMeets or exceeds, Apple's quality standards and requirementsIdentical To: CT2K4G3S1067M\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                              \n\n\n\n\n\n", "mpn": "CT2K4G3S1067M", "brand": "Crucial", "upc": "132017756400", "url": "http://www.ebay.com/itm/New-Crucial-8GB-4GB-x-2-DDR3-DDR3L-1066-MT-s-PC3-8500-CL7-204-Pin-SODIMM-/261858240264?hash=item3cf7f7a708", "ebayID": "261858240264", "price": "65.71"},
{"category": "20460", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Please see PhotosGift Rating (see below): B1 king flat, fitted, and 2 pillowcasesRETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\n\n\n", "url": "http://www.ebay.com/itm/CALVIN-KLEIN-WHITE-LABEL-STAMP-MUSHROOM-COTTON-SATEEN-4pc-KING-SHEET-SET-/121706167346?hash=item1c5640bc32", "brand": "Calvin Klein", "ebayID": "121706167346", "price": "\n\t\t\t\t\t\t\t\t\t\t62.64"},
{"category": "20614", "asin": ["B002KCO96C"], "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nNew , Dirt Devil Simpli-Stik Lightweight Corded Bagless Stick Vacuum, SD20000RED\n\n \n\n\nItem Description\n\n\nThe Dirt Devil Versa Power is a one step solution for quick and convenient cleanups. This versatile unit functions as a stick vac, hand vac, and a utility vac all in one. The vacuum cleaners lightweight design makes it simple to transport from room to room, while its easy-empty dirt cup means no more bags to buy. An onboard crevice tool comes included, which allows for cleaning hard to reach areas like between couch cushions, along baseboards, or under furniture and appliances. Great for multi-purpose cleaning.\n\n\n3-in-1 vacuum cleaner functions as a stick vac, handheld vac, and utility vac\nHandheld unit detaches easily from the larger unit; onboard crevice tool\nSimple on/off switch; smooth-rolling wheels; convenient cord wrap\nLightweight construction for comfortable carrying; removable dust cup\nMeasures approximately 7 by 11 by 45 inches\nF25 Filter - 2SV1102000 fits this unit\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "SD20000RED", "brand": "Dirt Devil", "upc": "046034896301", "url": "http://www.ebay.com/itm/New-Dirt-Devil-Simpli-Stik-Lightweight-Corded-Bagless-Stick-Vacuum-SD20000RED-/251867270091?hash=item3aa4758bcb", "ebayID": "251867270091", "price": "23.88"},
{"category": "58211", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Please see PhotosGift Rating (see below): ASolid carbide tools offer long tool life and faster cutting speeds than other substrates, but are more brittle and must be used with rigid toolholding systemsUncoated tools feature just the base substrate without any additional treatment or coatings and are suitable for a wide range of applicationsDesigned for heavy roughing to semi-finishing of all steelsCan be used for roughing, semi-finishing and finishing proportionate to the size and the nose radius of the insert80 degrees diamond with chipbreakerBrand NameCobra CarbidePart Number40176Material TypeCarbideFinish TypesUncoated (Bright)Number of Items10ShapeDiamondArbor Hole Diameter0.203  inchesCorner Radius0.0313  inchesCut TypeFinishing, Semi-finishing and RoughingCutting DirectionRight-HandManufacturer GradeC550Outside Diameter0.5  inchesSizeCNMG 432Style NameCNMGThickness0.1875  inchesUNSPSC Code31162802\n\n\n\n", "mpn": "40176", "brand": "Cobra", "url": "http://www.ebay.com/itm/NEW-7PCS-CNMG-432-C550-CARBIDE-INSERTS-Cobra-Carbide-Uncoated-Turning-/121714162668?hash=item1c56babbec", "ebayID": "121714162668", "price": "9.56"},
{"category": "63748", "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nCasino 6-Deck Automatic Card Shuffler, Free Shipping, New\n\n \n\n\nItem Description\n\n\nCard shufflers have always been popular amongst the avid card player and amateur alike. One reason they are popular is that it tends to move the game along and give you a professional shuffle, something not everyone is able to do for a variety of reasons (elderly, children, novices). Another reason for the popularity of shufflers is that they can literally be used with any playing card for any card game. So whether its poker night with the guys, bridge night with the girls, or a battle between magic the gathering players, shufflers are definitely here to stay.  Featured in this listing is the Casino 6 Deck Automatic Card Shuffler by Brybelly. This product easily handles up to 6 decks of cards and shuffles them in seconds! It is also battery operated, making it easy to operate and portable. Our Casino 6 Deck Automatic Card Shuffler is specifically styled to mimic those that you'd see in casinos or other professional establishments. So not only do you get an excellent quality product that performs well but also a stylish, professional looking shuffler that all of your friends will envy. Because poker night isn't poker night without a Casino quality Card Shuffler!  Brybelly Shufflers are especially noted for their high quality. Brybelly shufflers are fun to play with and easy to use. In general, the Brybelly brand is known throughout the home casino gaming market as the number one choice among gaming experts. Their long history of satisfied customers and innovative products has made Brybelly the number one choice among poker players and gamers alike.  So if you're looking for a card shuffler that will not only work for years to come but also look good doing it look no further. Brybelly's 6 Deck Card Shuffler is of excellent quality and one of our top selling products. We know you will be happy with your purchase for years to come and look forward to having a long and growing relationship with you as one of our many valued customers.\n\n\nShuffles up to 6 decks in seconds\nFully automatic card shuffler\nBattery operated and fully mobile shuffler\nFast and easy to use for any card game\nAnother high quality and durable product from Brybelly\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "GSHU-003", "brand": "Brybelly", "url": "http://www.ebay.com/itm/Casino-6-Deck-Automatic-Card-Shuffler-Free-Shipping-New-/261802119657?hash=item3cf49f51e9", "ebayID": "261802119657", "price": "50.70"},
{"category": "177005", "asin": ["B0076A2KPK", "B0039ZM95C", "B002RL9ETI"], "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nTop Chef by Master Cutlery 5-Piece Chef Basic Knife Set with Nylon Carrying Case\n\n \n\n\nItem Description\n\n\nOfficially licensed Bravo TV Top Chef 5-piece Knife Set (7-inch Santoku, 5-inch Santoku, 3.5-inch Paring Knife, Sharpening Stick and Nylon Carrying Case).  Knives feature Ice-Tempered Stainless Steel Blades w/ precision cut sharpened cutting edges and hollow grounds to reduce sticking and laser-etched Top Chef logos on each blade.  Knives and Sharpening Stick feature full steel handles w/ seamless bonded and polished bolsters and non-slip surfaces.  Nylon Carrying Case seals easily and features a Top Chef Logo Metal Plate.As seen on Top ChefLaser-etched Top Chef LogosPrecision-sharpened cutting edgesIce-Tempered Stainless Steel BladesFull-steel non-slip surface handles for easy use\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "TC-03", "brand": "Top Chef by Master Cutlery", "upc": "805319617303", "url": "http://www.ebay.com/itm/Top-Chef-by-Master-Cutlery-5-Piece-Chef-Basic-Knife-Set-with-Nylon-Carrying-Case-/261803119468?hash=item3cf4ae936c", "ebayID": "261803119468", "price": "38.21"},
{"category": "20642", "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nOXO Good Grips Green Salad Spinner , New Free Shipping\n\n\n \n\n\nItem Description\n\n\n\n\nOXO's Salad Spinner  A different \"Spin\" on lettuce\nOXO's Salad Spinner was inspired by a children's top, illustrating how even the most basic products can influence design innovation. Before its introduction in 1998, crank or pull-tab salad spinners were considered high-end products. Some people even used the spin cycle of their washing machine to dry lettuce. The easy-to-use OXO Salad Spinner turned the tool into an everyday kitchen essential.\nFun Fact: Recently, OXO's Salad Spinner was turned into a portable centrifuge to diagnose anemia in rural parts of the world.\nProblems Identified\n\nDifficult to Start: Pull-string and crank-style spinners require fine motor skills and strength to begin the spinning motion.\nSoggy Lettuce: Some salad spinners do not achieve high levels of RPM, leaving users with damp lettuce that has to be \"towel-dried\" before serving.\nCumbersome to Operate: Spinners commonly spin out of control on countertops unless one hand is holding it down tightly while the other is pulling or cranking.\nTroublesome to Clean: It is not uncommon for lettuce to get caught in the lid of a salad spinner.\n\n\nEarly OXO Salad Spinner Prototype\n\nThe Process\n\nPush of a button: During user research, the development team learned that people inherently enjoy the action of pressing down on a button. Not only is it fun and easy to do, but it gives them a sense of satisfaction that something is working.\nUse the force: Early in the development process, the designer actually calculated the surface tension of water droplets on lettuce. This helped determine the precise level of centrifugal force required dislodge the water and dry the lettuce without damaging it.\nWeeble-Wobble: The centrifugal force required to dry lettuce without bruising it was so high that the Spinner had a tendency to walk or wobble all over the countertop. Because of this, users had to use two hands  one to pump and the other to hold the Spinner steady.\nA Separate Piece: Our first attempt at a take-apart lid included pull tabs that held the lid securely together, but required too much force to separate the pieces.\n\n\n \n\nOXO's Solutions\n\nGet Pumped: The pump-style design makes it very easy for people of all ages and abilities to use without the need for significant hand strength or fine motor skills.\nDry Idea: Continuous turning in the same direction allows the Salad Spinner basket to achieve higher RPM than most other spinners, resulting in the driest, crispest lettuce possible.\nWon't Slip: A combination of a non-slip ring bonded to the bottom of the bowl and the downward force from the pump keep the Salad Spinner steady on the table, allowing users to operate it with just one hand.\nEasy-to-clean: The clear lid immediately signals whether there is leftover lettuce caught inside and it comes apart with a simple pull to wash thoroughly.\n\nThe OXO Story:\nIn 1990, OXO staged a revolution (of sorts) by offering an easy-to-use, high-performing alternative to uncomfortable and ineffective kitchen gadgets. OXO's innovative take on the traditional Swivel Peeler, complete with its pudgy black handle, raised consumers' expectations of what could be expected from household products.\nToday OXO offers over 800 products, each developed with a close (some might say \"obsessive\") attention to detail. Our goal is to deliver products that maximize comfort AND performance, illustrating our mission to create innovative consumer products that make everyday living easier.\nEver wonder what makes an OXO product an \"OXO Product\"?\nOXO employees believe there are two rules that should guide product development: First, every new product must deliver a significant improvement over the status quo. Second, the functionality should never be sacrificed to make the product more attractive  above all it should work well.\n\n\n\n\nEasy, one-handed operation; Patented pump mechanism and brake button\nSoft, non-slip knob locks down for storage; Non-slip ring and wide base keep bowl steady on countertop\nBasket can be used separately as a colander; Elegant, clear bowl is perfect for serving\nThe capacity is 4.49-quarts; Flat lid allows for convenient stacking when not in use\nClear lid disassembles for easy cleaning; Top-rack dishwasher safe\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, unopened items within 14 days of delivery for a refund, minus a 15% restocking fee. If the return is a result of our error, we'll provide a prepaid return label and the restocking fee will be waived. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "1155901", "brand": "OXO", "url": "http://www.ebay.com/itm/OXO-Good-Grips-Green-Salad-Spinner-New-Free-Shipping-/251817024834?hash=item3aa176dd42", "ebayID": "251817024834", "price": "35.77"},
{"category": "52357", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Please see PhotosGift Rating (see below): AThe exterior is leather and the interior lining is nylon.15\" across12\" high 3 1/2\" deepNO SHOULDER STRAP INCLUDEDRETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\n\n\n", "url": "http://www.ebay.com/itm/BLACK-LEATHER-BRIEFCASE-LAPTOP-SHOULDER-BAG-/121705703007?pt=LH_DefaultDomain_0&hash=item1c5639a65f", "brand": "Eddie Bauer", "ebayID": "121705703007", "price": "25.50"},
{"category": "15662", "asin": ["B0009VELG4", "B00G4NXPR2", "B004FJU3XG", "B00GYB5J8C"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nSpalding NBA Street Basketball - Official Size 7 (29.5)\n\n\nThe Spalding Official NBA Street Outdoor Rubber 29.5 Mens Basketball is designed for competitive outdoor street play! This durable size 7 basketball features a performance outdoor rubber cover with a wide channel design for incredible grip and feel. Official NBA size and weight.Ultra-durable, performance rubber coverDesigned to withstand the rough-and-tumble street gameWide channel design for excellent gripFeatures the NBA logoOfficial size 29.5 inches, size 7 (Size is not stamped on ball)\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                                \n\n\n\n\n", "mpn": "63-249", "brand": "Spalding", "upc": "029321632493", "url": "http://www.ebay.com/itm/Spalding-NBA-Street-Basketball-Official-Size-7-29-5-/261835986401?hash=item3cf6a415e1", "ebayID": "261835986401", "price": "15.58"},
{"category": "175750", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Please see PhotosGift Rating (see below): ABrand-new quilted throw. 100% cotton. 50\" x 60\". Gorgeous vibrant colors. Reverses to a red with turquoise stitching. Very cool!RETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\n\n\n", "url": "http://www.ebay.com/itm/NEW-Greenland-Home-Jewel-Throw-blanket-Multicolor-50-X60-Boho-Red-coloful-COOL-/111728482317?hash=item1a0389580d", "brand": "Greenland Home", "ebayID": "111728482317", "price": "42.00"},
{"category": "170083", "asin": ["B008PSGYR2", "B008LTBIT4", "B00NCMBETE", "B00CF6ZF4I"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nCrucial 8GB Kit (4GBx2) DDR3 1333 MT/s (PC3-10600) CL9 204-Pin SODIMM Memory For\n\n\nCT2K2G3S1339M is a 8GB kit consisting of (2) 4GB DDR3 Notebook modules that operates at speeds up to 1333 MT/s and has a CL9 latency. It is dual voltage and can operate at 1.35V or 1.5V. It is Unbuffered and is non-ECC. It conforms to the industry standard SODIMM layout of 204 pins and is compatible with computers that take DDR3 SODIMM memory.Increases system performanceCompatible with Mac SystemsPremium quality memory from a trusted brandDDR3 Low Voltage / DDR3L DRAMLimited Lifetime Warranty\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                              \n\n\n\n\n\n", "mpn": "CT2K4G3S1339M", "brand": "Crucial", "upc": "649528762030", "url": "http://www.ebay.com/itm/Crucial-8GB-Kit-4GBx2-DDR3-1333-MT-s-PC3-10600-CL9-204-Pin-SODIMM-Memory-For-/261858241184?hash=item3cf7f7aaa0", "ebayID": "261858241184", "price": "67.96"},
{"category": "11554", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Gift Rating (see below): B+Organic Cotton Stylist JeansLow Rise Regular FitUsually $80 new!!!RETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\n\n\n", "url": "http://www.ebay.com/itm/PRANA-Womens-Designer-Low-Rise-Regular-Fit-Black-Jeans-Size-4-/111713072890?hash=item1a029e36fa", "brand": "PRANA", "ebayID": "111713072890", "price": "not_set"},
{"category": "11848", "asin": ["B0020MMD06"], "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nFancy by Jessica Simpson 100ml 3.4oz EDP Spray, Free Shipping, New\n\n \n\n\nItem Description\n\n\n3.4 oz EDP SprayWhen applying any fragrance please consider that there are several factors which can affect the natural smell of your skin and, in turn, the way a scent smells on you.  For instance, your mood, stress level, age, body chemistry, diet, and current medications may all alter the scents you wear.  Similarly, factor such as dry or oily skin can even affect the amount of time a fragrance will last after being applied\n\n\nPackaging for this product may vary from that shown in the image above\nThis item is not for sale in Catalina Island\nThis item is not for sale in Catalina Island\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "8558", "brand": "Jessica Simpson", "upc": "608940541067", "url": "http://www.ebay.com/itm/Fancy-by-Jessica-Simpson-100ml-3-4oz-EDP-Spray-Free-Shipping-New-/251867696091?hash=item3aa47c0bdb", "ebayID": "251867696091", "price": "26.30"},
{"category": "87125", "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nLifeStraw Personal Water Filter , New , Free Shipping\n\n\n \n\n\nItem Description\n\n\nA Time Magazine Invention of the Year winner, LifeStraw contains no chemicals, no batteries and no moving parts to wear out. It features a high flow rate and weighs only 2oz. It is perfect for the Ultralight backpacker, camper, hiker, traveler, boy scout, hunter or for emergencies. Unlike many similar filters on the market today, LifeStraw has met EPA standards for water filtration in independent testing. LifeStraw has been used around the world under extreme conditions for humanitarian relief. Does not filter chemicals, salt, viruses, heavy metals, taste. Please NOTE: It takes roughly 3-5 seconds of sucking to start the flow of water through the filter.\n\n\nAward-winning LifeStraw has been used by millions around the globe since 2005\nRemoves minimum 99.9999% of waterborne bacteria (>LOG 6 reduction) and surpasses EPA standards for water filters\nRemoves minimum 99.9% of waterborne protozoan parasites (>LOG 3 reduction) and filters to an amazing 0.2 microns\nFilters up to 1000 liters of contaminated water WITHOUT iodine, chlorine, or other chemicals\nComes in a sealed bag, perfect for storing for emergencies\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, unopened items within 14 days of delivery for a refund, minus a 15% restocking fee. If the return is a result of our error, we'll provide a prepaid return label and the restocking fee will be waived. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "001", "brand": "LifeStraw", "url": "http://www.ebay.com/itm/LifeStraw-Personal-Water-Filter-New-Free-Shipping-/261754674085?hash=item3cf1cb5ba5", "ebayID": "261754674085", "price": "23.63"},
{"category": "152354", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... With TagsSize T short sleeve LeotardABOUT FSB SERVICES:\nAfter finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount.  The items we have are Open Box Store Returns.   This means for the most part someone purchased the item and took it home.  For some reason they decided to return the item.  The reasons very greatly ..  for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken.   We endeavor to make sure what we are selling you is not broken.  If there is a blemish we endeavor to make that blemish clear.  If your items must be perfect, we suggest you purchase your items from Macys or Sears.  If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us.  If something slipped by in our QC process, please let us know.  Our intent is for a WIN-WIN.  You receive a product at a nice discount and we make some money to help our families.\n\nTo Help reduce costs and save our environment.  Your product will most likely arrive in \"re-purposed\" packaging.  \n\nFroo www.froo.com | Froo Cross Sell, Free Cross Sell, Cross promote, eBay Marketing, eBay listing Apps, eBay Apps, eBay Application\n\n\n\n\n", "url": "http://www.ebay.com/itm/Capezio-CC400C-short-sleeve-leotard-scoop-neck-black-girls-new-size-T-/121480123283?pt=LH_DefaultDomain_0&hash=item1c48c79393", "brand": "Capezio", "ebayID": "121480123283", "price": "not_set"},
{"url": "http://www.ebay.com/itm/Deluxe-Poly-Cotton-Massage-3-Piece-Sheet-Set-Color-White-/121612708034?hash=item1c50aea8c2", "category": "19263", "ebayID": "121612708034", "price": "not_set", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Believed to be new and unusedActual use is Undetermined Please see PhotosGift Rating (see below): AItem model number: Deluxe Poly Cotton Massage Sheet SetMassage Table Poly/Cotton Massage Sheet Set , 3-PCS Set (Color = Natural)The extra large flat sheet (61x91 inches) ensures that even your largest customers will stay coveredMade of 170 thread count soft 45/55 poly/cotton blendAvailable in Natural or WhiteGreat Quality, Non Pilling Sheet. Shipping: Economy shipping is listed.   We will ship the product as effeciently as possible.  We preferUSPS but will ship via FedEx Smartpost, FedEx Ground and UPS as well.  If you need delivery to meet a schedule, PLEASE LET US KNOW.   We can always negotiate for an appropriate shipping means through the offer channel.   Sometimes it is only a few dollars different between economy and USPS Priority.   We will work with you on shipping.RETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\nFroo www.froo.com | Froo Cross Sell, Free Cross Sell, Cross promote, eBay Marketing, eBay listing Apps, eBay Apps, eBay Application\n\n\n\n\n"},
{"category": "20673", "asin": ["B00MOS3G16", "B0038KPRG6"], "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nBlack n Decker FP1600B 8-Cup Food Processor, Black\n\n \n\n\nItem Description\n\n\nPerfectly slice, chop, mince, mix and shred your favorite foods with the durable stainless steel chopping blade or the slice and shredder disk.\n\n\n450-watt food processor for slicing, dicing, chopping, mincing, grating, and more\n8-cup-capacity work bowl; continuous-flow feed chute with pusher; on and off/pulse buttons\nSafety interlock system; suction-cup feet; cord storage; dishwasher-safe parts\nIncludes stainless-steel chopping blade and reversible slicing/shredding disc\nMeasures 11-2/7 by 7-4/5 by 15-2/3 inches\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to PR , AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "FP1600B", "brand": "Black & Decker", "upc": "050875804449", "url": "http://www.ebay.com/itm/Black-Decker-FP1600B-8-Cup-Food-Processor-Black-/261822558156?hash=item3cf5d72fcc", "ebayID": "261822558156", "price": "37.01"},
{"category": "109489", "description": "\n\n\n\n\nOPEN BOX STORE Shelf Pulls...  Please see PhotosGift Rating (see below): A17 3/8\" drop in anchors with set tool7 1/2\" drop in anchors with set tooltotal 25 pieces (1 bonus 1/4\" Drop in)Shipping: Economy shipping is listed.   We will ship the product as effeciently as possible.  We preferUSPS but will ship via FedEx Smartpost, FedEx Ground and UPS as well.  If you need delivery to meet a schedule, PLEASE LET US KNOW.   We can always negotiate for an appropriate shipping means through the offer channel.   Sometimes it is only a few dollars different between economy and USPS Priority.   We will work with you on shipping.RETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\nFroo www.froo.com | Froo Cross Sell, Free Cross Sell, Cross promote, eBay Marketing, eBay listing Apps, eBay Apps, eBay Application\n\n\n\n\n", "mpn": "Does Not Apply", "brand": "Unbranded/Generic", "url": "http://www.ebay.com/itm/17-3-8-7-1-2-drop-in-anchor-25pcs-Zinc-with-1-2-and-3-8-set-tool-/121702830621?hash=item1c560dd21d", "ebayID": "17", "price": "not_set"},
{"category": "20684", "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nBrita 10-Cup Everyday Water Filter Pitcher , New Free Shipping\n\n\n \n\n\nItem Description\n\n\n\n\n\n\nThe Brita Everyday features a large, ten (8-ounce) cup capacity. View larger\n\n\n\n\nA single Brita filter can replace up to 300 standard 16.9-ounce water bottles.\n\n\n \n\nProvide great-tasting, healthier* water for your family, office, or team with the Brita Everyday Water Filter Pitcher. The BPA-free pitcher's included filter reduces unwanted tastes and odors from chlorine often found in tap water. With a large 10-cup capacity, the Brita Everyday Pitcher is a cost-effective, convenient alternative to buying bottled water.\n\nGreat-Tasting, Healthier* Water\n\nThe Brita Everyday Water Filter Pitcher comes with one activated carbon and ion-exchange resin filter that reduces chlorine taste and odor, zinc, copper, mercury, and cadmium* often found in tap water. One Brita water filter can replace up to 300 standard 16.9-ounce water bottles, saving you money and time.\n\nLarge Capacity\n\nThe Brita Everyday Pitcher features an oval design and can hold up to ten 8-ounce cups to help you keep water on hand.\n\nSimple to Use\n\nDesigned for easy use, this water filter pitcher has a removable lid. When it is time to refill, pop off the lid and slip the pitcher under your tap. Maintaining the filter's best performance is simple as well with the sticker filter indicator that helps you keep track of when you need to change the water filter. *Certified to reduce copper and mercury. Contaminants reduced may not be in all users' water. **Filter should be replaced after 40 gallons/151 liters (about two months for the average family).\n\n\n\n\n\n\n \nBrita Everyday features:\n\n\nLarge, ten (8-ounce) cup capacity\nProvides great-tasting, healthier* water\nOne filter replaces up to 300 standard 16.9-ounce water bottles\nIncludes sticker filter indicator\nBPA-free pitcher\nWhat's in the Box: Brita Everyday Water Filter Pitcher, White, and Brita Water Filter.\n\n\n \nDirections\n\nYour water filter pitcher can be ready for use in just a few steps. Wash your hands before touching the water filter, then soak it upright for 15 minutes in cold water. Rinse under running tap water and insert the filter into the reservoir, lining up the groove in the filter with the notch in the reservoir. Add cold tap water. The first three pitchers of filtered water may contain carbon dust and can be used on plants or discarded. The filter indicator reminds you to replace the water filter every 40 gallons or two months. **\n\n\n \n\n\n\nBrita water filter pitchers come in a variety of capacities, styles, and colors.\n\n\n\n\nBrita Slim Water Pitcher\n\n\n\n\nBrita Atlantis Water Pitcher\n\n\n\n\nBrita Stainless Water Filter Pitcher\n\n\n\n\nBrita Everyday Water Filter Pitcher\n\n\n\n\nBrita Grand Water Filter Pitcher\n\n\n\nCompact (5 or 6 cups)\n\n\na\n\n\na\n\n \n \n \n\n\n\nLarge (8 or 10 cups)\n\n \n \n\na\n\n\na\n\n\na\n\n\n\n\nElectronic Filter Change Indicator\n\n \n \n\na\n\n \n\na\n\n\n\n\nEasy-Fill Lid\n\n \n\na\n\n\na\n\n \n\na\n\n\n\n\nComfort Grip Handle\n\n \n\na\n\n\na\n\n \n\na\n\n\n\n\nAssorted Colors or Patterns\n\n \n\na\n\n \n \n\na\n\n\n\n\nBPA-Free\n\n\na\n\n\na\n\n\na\n\n\na\n\n\na\n\n\n\n\n \n\n\n\nLarge basic 10 cup water filtration pitcher with 1 filter\n1 water filter can replace 300 standard 16.9 ounce water bottles\nReduces chlorine taste and odor, zinc taste, copper, mercury and cadmium, often found in tap water\nBPA-free pitcher in clean white color and standard oval design\nSticker filter indicator for tracking when to change the water filter\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, unopened items within 14 days of delivery for a refund, minus a 15% restocking fee. If the return is a result of our error, we'll provide a prepaid return label and the restocking fee will be waived. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "35509", "brand": "Brita", "url": "http://www.ebay.com/itm/Brita-10-Cup-Everyday-Water-Filter-Pitcher-New-Free-Shipping-/251817043693?hash=item3aa17726ed", "ebayID": "251817043693", "price": "26.60"},
{"url": "http://www.ebay.com/itm/Diasonic-DL-65TH-LED-Desk-Lamp-New-Black-/111725726615?hash=item1a035f4b97", "category": "112581", "ebayID": "111725726615", "price": "58.54", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Please see PhotosGift Rating (see below): ALED Desk Lamp DL-65th11W for lighting4W for ChargingBrightness 1,100 LuxLife time 40,000 hoursRETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\n\n\n"},
{"category": "20672", "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n@#$%%^&*~IAO\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\nBuy Now\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nAroma 8-Cup (Cooked) Digital Rice Cooker and Food Steamer, Stainless Steel\n\n\n\n\n\n\nSteam food and cook rice at the same time!\n\n\n\n\nDishwasher safe accessories included.\n\n\nLet Aroma do the Cooking for You\n\nEnjoy easy home cooking with the Aroma 8-Cup Digital Rice Cooker & Food Steamer. Restaurant-quality rice. Healthy steamed meals. Delicious one-pot dishes. Prepare all this and more at the press of a button. Aroma takes the \"cook\" out of home cooking - turning kitchen time into your time. Help the kids with homework, get creative at play time, or pick up that novel you've been waiting to dive into. All while delivering hot, hearty and healthy meals the entire family will love.\n\nDigital Convenience\n\nThis convenient cooker's compact capacity perfectly cooks 2 to 8 cups of any variety of rice with specialized functions for both white and brown rice. Once the rice has finished, it will automatically switch to Keep-Warm so there's no need for monitoring or stirring. The Steam Tray allows for healthy steaming of meats and vegetables, even as rice cooks below. It's also suitable for oatmeal, chili, jambalaya, soups, and more.\n\nDelay Timer\n\nThe Delay Timer is designed for people on the go. Place rice in the cooker in the morning, set the Delay Timer to have rice ready when it's needed and come back to perfect rice ready to serve. Plus, no matter when rice is finished, the cooker will automatically switch to Keep-Warm for conveniently flexible meal planning. So, no matter what wrenches life throws in your schedule, you'll still come home to a quality meal ready when you are.\n\nEasy Cleanup\n\nCleaning up is never fun. When the cooking is done, the inner cooking pot and all accessories remove for easy cleanup.\n\n\n\n\n\n\n \nFeatures\n\n\nPerfectly prepares 2 to 8 cups of any variety of cooked rice\nSteams meat and vegetables while rice cooks below\nEasy-to-use, programmable digital controls with automatic Keep-Warm and White Rice and Brown Rice functions\nGreat for soups, jambalaya, chili, and more\n15-hour Delay Timer for flexible meal planning\nIncludes steam tray, rice measuring cup, and serving spatula\n\n\n \n \n \n\n \n\n\n\nCompare Products\n\n\n\nARC-914SBD\n\n\nAroma 8-Cup Rice Cooker and Food Steamer\n\n\n\nARC-914SB\n\n\nAroma 8-Cup Rice Cooker and Food Steamer\n\n\n\nARC-150SB\n\n\nAroma 20-Cup Rice Cooker, Food Steamer and Slow Cooker\n\n\n\nARC-2000SB\n\n\nAroma 20-Cup Rice Cooker, Food Steamer and Slow Cooker\n\n\n\nARC-1010SB\n\n\nAroma 20-Cup Rice Cooker and Food Steamer with STS\n\n\n\nProgrammable Digital Controls\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nSpecialized functions for White and Brown Rice\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nSteam meat and veggies while rice cooks below\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDelay Timer\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nSlow Cook function\n\n \n \n\n\n\n\n\n\n \n\n\n\nSaute-Then-Simmer Technology (STS)\n\n \n \n \n \n\n\n\n\n\n\nIncludes Steam Tray, Rice Measuring Cup and Serving Spatula\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nItem holds up to 2 to 8 cups of cooked rice. 8 cups is the cooked rice capacity.\nSteams meat and vegetables while rice cooks below\nEasy-to-use, programmable digital controls with automatic Keep-Warm and White Rice and Brown Rice functions\nGreat for soups, jambalaya, chili, and more\n15-hour Delay Timer for flexible meal planning\nIncludes steam tray, rice measuring cup, serving spatula, and exclusive recipes and coupons for Mahatma and Carolina Rice\n\n\n\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\nCall Us: 1800-2043101\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n\n50%\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "ARC-914SBD", "brand": "Aroma", "url": "http://www.ebay.com/itm/Aroma-8-Cup-Cooked-Digital-Rice-Cooker-and-Food-Steamer-Stainless-Steel-/261757158590?hash=item3cf1f144be", "ebayID": "261757158590", "price": "37.40"},
{"category": "1280", "description": "\n\n\n\n\nOpen box store return.  Packaging is incomplete or torn.  Replacement Baffle for InSinkErator  DisposersHelps Reduce SoundDETAILS Manufacturer: InSinkEratorColor: BlackItem DimensionsLength: 4.1\"Width: 4\"Height: 1.9\"Weight: 0.1 poundsABOUT FSB SERVICES:\nAfter finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount.  The items we have are Open Box Store Returns.   This means for the most part someone purchased the item and took it home.  For some reason they decided to return the item.  The reasons very greatly ..  for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken.   We endeavor to make sure what we are selling you is not broken.  If there is a blemish we endeavor to make that blemish clear.  If your items must be perfect, we suggest you purchase your items from Macys or Sears.  If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us.  If something slipped by in our QC process, please let us know.  Our intent is for a WIN-WIN.  You receive a product at a nice discount and we make some money to help our families.\n\nTo Help reduce costs and save our environment.  Your product will most likely arrive in \"re-purposed\" packaging.  \n\nFroo www.froo.com | Froo Cross Sell, Free Cross Sell, Cross promote, eBay Marketing, eBay listing Apps, eBay Apps, eBay Application\n\n\n\n\n", "url": "http://www.ebay.com/itm/InSinkErator-SMG-00-Standard-mounting-Gasket-Black-New-/121706519134?pt=LH_DefaultDomain_0&hash=item1c56461a5e", "brand": "InSinkErator", "ebayID": "121706519134", "price": "11.25"},
{"category": "20349", "asin": ["B00VMEZNE6"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nRedpepper Waterproof Case Cover for iPhone 5 5s Color Black\n\n\nLight weight,Slim,and Perfect fit for the Apple iPhone 5/5S Water Proof: up to 6.6ft underwater to IP68 standards. Take to surfing, swimming and snorkeling up to 6.6ft underwater or just relax in the bath Dirt Proof: totally sealed against minute dirt & dust ingress Snow Proof: fully enclosed to keep melting snow, sleet and ice out Shock Proof: withstands drop impacts from up to 6.6'(2m) Design: the thinnest, lightest, toughest, most functional all-protective phone case available Function: Restriction-free access to almost all functions, buttons, controls and ports, it can also support fingerprint identification Optics: Crystal Clear double AR-coated optical-glass lens for distortion-free photos and videos\n\nWater Proof: Submergible to 6.6ft(2m) for up to 30 Minutes\nDirt Proof: Totally Sealed Against Minute Dirt & Dust Ingress\nSnow Proof:Fully Enclosed to Keep Melting Snow, Sleet and Ice Out\nShock Proof: Withstands Drop Impacts From up to 6.6ft(2m)\nPackage includes: Waterproof Case, Headphone Adapter, User Instruction\n\n\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                             \n\n\n\n\n\n", "url": "http://www.ebay.com/itm/Redpepper-Waterproof-Case-Cover-for-iPhone-5-5s-Color-Black-/252017803925?hash=item3aad6e8295", "brand": "Redpepepr", "upc": "701419605373", "ebayID": "252017803925", "price": "48.30"},
{"category": "79686", "asin": ["B000WEMH3C", "B00Y4YK69S", "B00BEWLCJ6", "B0044V0UBU", "B0007IMT8Q", "B00Y23WSDI"], "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Please see PhotosGift Rating (see below): BNice charcoal grill coverRETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\n\n\n", "mpn": "7451", "brand": "Weber", "upc": "077924074080", "url": "http://www.ebay.com/itm/Weber-7451-Gray-Standard-Cover-for-22-1-2-Grills-/121709383654?pt=LH_DefaultDomain_0&hash=item1c5671cfe6", "ebayID": "121709383654", "price": "8.44"},
{"category": "20719", "asin": ["B00QR87BZG"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nBrazilian Hammock - Double - Soft Cotton Weave for Supreme Comfort - Stylish Col\n\n\nMORE COMFORTABLE  These Brazilian Style Hammocks are well known around the world for their unmatched comfort. Their long-standing secret is the tight weave & \"cocoon effect\" that make this one of the most restful hammocks in the world.   THEY'RE BEAUTIFUL  Our colorful Brazilian Hammocks are not only comfortable but also aesthetically pleasing. They quickly become an essential part of your \"backyard oasis\" decor & serve to make neighbors jealous.   THEY LAST LONGER  Created in the same style that's been handed down for generations by artisans in Northeastern Brazil, they're tightly woven with high quality colorfast cotton thread, which ensures you'll enjoy your Brazilian Hammock for many years to come (contrary to flimsier string hammocks which easily come undone).   THEY'RE PORTABLE  Planning a camping trip or a lengthy backpacking excursion? This Brazilian Hammock easily fits in your backpack & provides a comfortable camp spot at the end of a tough day. Need a permanent relaxation spot in your yard, back porch, cottage or indoors? This beauty fits the bill. It's lightweight enough to be easily transported from one spot to the next or left in a one location on a permanent basis.   100% GUARANTEED  We stand behind our claim that you'll fall into \"Hammock Bliss\" the second you try it. If, for any reason, you aren't 100% happy with it, we'll give you your money back, no questions asked.   AAA What's Included: Hammock + FREE Carry Pouch  AAA Manufacturer's Warranty: 1 year  AAA Materials: 100% colorfast cotton  AAA Weight Capacity: 475 Pounds  AAA Recommended Hanging Distance: 12+ Feet (144+ Inches)  AAA Size: 2 People  AAA Store After Use: yes (in wet conditions)\n\nAAAAAA COCOON OF WEIGHTLESSNESS - Created in the style that has been handed down for generations by native artisans in Northeastern Brazil, these hammocks are tightly woven with comfortable, long-lasting colorfast cotton thread that gives the user a feeling of \"weightlessness\" - often described as laying on a soft sponge\nAAAAAA 100% MONEY BACK GUARANTEE - We dislike returns more than you do, so we make sure each one of our Hammocks is top-of-the-line exquisite quality. What we dislike even more than returns are folks that don't stand by their products and don't treat their customers with respect when there happens to be an issue. Rest assured, if you aren't 100% happy with this Hammock, we'll give you 100% of your money back, no questions asked\nAAAAAA HAMMOCK SIZE MATTERS - One way to differentiate between a high & poor quality Hammock is size. Our Brazilian Hammock's total length (from loop to loop) is 144 Inches while the bed resting area is 98 Inches Long X 59 Inches Wide\nAAAAAA GET BETTER SLEEP - If you've never had the experience of snoozing or sleeping overnight in a Brazilian Hammock, give yourself a treat. This Double Hammock is a perfect bed replacement thanks to it's closed weave & \"cradle\" effect (safe for those who move in their sleep). It's more economical, saves a ton of space & leads to deeper, more comfortable sleep when compared to a traditional mattress\nAAAAAA KIDS CANT GET ENOUGH OF IT - Our biggest customer complaint is that Mom & Dad can't get a \"turn\"... Set-it up in the backyard & just watch what happens when your little ones get a sight of it! This Hammock's kid-friendly design means the whole family can enjoy it\n\n\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                             \n\n\n\n\n", "url": "http://www.ebay.com/itm/Brazilian-Hammock-Double-Soft-Cotton-Weave-for-Supreme-Comfort-Stylish-Col-/261841544368?hash=item3cf6f8e4b0", "brand": "Hammock Sky", "upc": "799475616150", "ebayID": "261841544368", "price": "59.61"},
{"category": "79686", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Please see PhotosGift Rating (see below): A- ideal for use on Char-Broil's 7000 series grillsHeavy-duty vinyl construction protects your investment from snow, hail, rain, wind, pests, and debrisDrawstring closure at the base helps secure cover around your grillEasy to clean; just hose it down, or apply a vinyl cleaner for a glossier appearanceMeasures 53\"L x 21\"D x 35\"HRETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\n\n\n", "url": "http://www.ebay.com/itm/Char-Broil-53-Full-Length-Grill-Cover-Black-Vinyl-Free-Shipping-New-/111725726614?hash=item1a035f4b96", "brand": "Char-Broil", "ebayID": "111725726614", "price": "13.48"},
{"category": "170083", "asin": ["B0073FTQ1Y", "B005LDLVAO", "B006ZMZ5UC"], "description": "\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n \n\n\n \n\n\n\n \n\n \n\n\n\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nProduct of the Week\nFor a limitied time only This Product is on SALE!\nBuy it Now and get 15% discount on original price (the current price on EBAY is 15% off).\n \n\n\n15% off\n\n\nMoney Back Guaranteed!\n\n\nOmitrade's 30-Day Money Back Guarantee: No Questions Asked!\n\n\nYou have 30 days to try it  and enjoy this amazing product . If you're not 100% satisfied with it, We will refund your payment  no questions asked & guaranteed!\n\n\n\n\n\n\n\n\n\n\n \n \n \n\n\n \n\n\n\n\nnew\n\n\n\n\nlast\n\n\n \n\nCrucial 8GB Kit (4GBx2) DDR3 1600 MT/s (PC3 - 12800) CL11 SODIMM Notebook Memory\n\n\nCT2CP51264BF160B is an 8GB kit consisting of (2) 4GB DDR3 Notebook modules that operates at speeds up to 1600 MT/s and has a CL11 latency. It is dual voltage and can operate at 1.35V or 1.5V. It is Unbuffered and is non-ECC. It conforms to the industry standard SODIMM layout of 204 pins and is compatible with computers that take DDR3 SODIMM memory.  Not Mac compatible.Increases system performanceEasy to installPremium quality memory from a trusted brand100% TestedIdentical To: CT2CP51264BF160B\n\n\n\n\n\n\nReturns\n \nYou may return all items within 30 days of delivery for a refund,  we'll provide a prepaid return label. Items must be returned in the condition they arrived in. The box, , and all other accessories must be returned.\n\n\n\n\nShipping\n \nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped.We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\n\n\nPayment\n \nOur prefered payment method is  PAYPAL\n\n\n\n\n Tax\n \nWe have order fulfillment centers throughout the US. We are required to charge sales tax in some states .\n\n\n\n\n\n\n\n\nItem Description\n\n \n\n\n \n\n\n\n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nQuality Service\nWe have hundreds of positive feedbacks from our satisfied customers . We ship all items from the US and most are shipped within 1 business day and FREE !\n\nCustomer Satisfaction\n\n\n\n \n\n\n\n\n\nQuality Products\nEverything we sell is brand new and factory sealed . If you are not happy with it you may return within 30 days and get your full money back!\n\nNew & Sealed\n \n\n\n\n\n\n\n\n\n                                                                                                              \n\n\n\n\n\n", "mpn": "CT2KIT51264BF160B", "brand": "Crucial", "upc": "649528754257", "url": "http://www.ebay.com/itm/Crucial-8GB-Kit-4GBx2-DDR3-1600-MT-s-PC3-12800-CL11-SODIMM-Notebook-Memory-/261858240572?hash=item3cf7f7a83c", "ebayID": "261858240572", "price": "56.18"},
{"category": "52357", "description": "\n\n\n\n\nOPEN BOX STORE RETURN... Please see PhotosGift Rating (see below): ASpecifications- Soft sided toiletry kit- One clear vinyl interior bag to keep everything organized- Interior organizer pockets- Fits easily inside Split Roller interior pocketsRETURNS: We will accept returns on this item. The buyer will pay freight to and from and a 20% restocking fee will be charged. Please ask questions before you buy. To Return the item must be in the EXACT same condition as received. It may not be used. Once it is used, You own it.GIFT RATING:  We have decided to add a Rating on our items.  A: Item looks like it came of the Store Shelf, B: B: Item is Fresh and Clean but some nicks in packaging. Acceptable for most gift giving. C: Good Item, packaging not nice, only give to those who won't criticize. perhaps remove from packaging to give. D: Marginal Gift Item, maybe ok for an understanding mate or close friend, definitely not an item for the discriminating eye. E: Not a good idea for gifting  F: Only for personal use.  This rating system is our personal guide. Your opinion May Differ.ABOUT FSB SERVICES: After finding a source that provided store returns at auction, we decided to offer the public the opportunity to purchase these items at a discount. MOST items we have are Open Box Store Returns. This means for the most part someone purchased the item and took it home. For some reason they decided to return the item. The reasons very greatly .. for some it was the wrong item, others it didnt fit the application, some it was the wrong color, some used the item one time and then returned it, other times they found a blemish that made them not want the product, sometimes the item is broken. We endeavor to make sure what we are selling you is not broken. If there is a blemish we endeavor to make that blemish clear. If your items must be perfect, we suggest you purchase your items from Macys or Sears. If you like the opportunity for a dramatic discount and still have a nice product... by all means please purchase from us. If something slipped by in our QC process, please let us know. Our intent is for a WIN-WIN. You receive a product at a nice discount and we make some money to help our families. To Help reduce costs and save our environment. Your product will most likely arrive in \"re-purposed\" packaging.\n\n\n\n", "url": "http://www.ebay.com/itm/Dakine-Womens-Prima-Travel-Bag-Medallion-5-Liter-/111708919310?hash=item1a025ed60e", "brand": "Dakine", "ebayID": "111708919310", "price": "not_set"},
{"category": "57065", "description": "\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nASK US A QUESTION\nSEE OUR FEEDBACK\nADD TO FAVOURITES\nSEE OUR OTHER ITEMS\nCONTACT\n\n\n\n\n\n\n  \n\n\n\nScotch Thermal Laminator 2 Roller System (TL901) , New Free Shipping\n\n\n \n\n\nItem Description\n\n\nScotch Thermal Laminator TL901 will laminate items up to 9 inches wide. It features a two roller system that has two temperature settings. It can be used for photographs, documents, recipes and much more. This laminator will laminate items up to 5mil thick, including popular 3mil and 5mil pouches. Businesses and families can always find a use for a laminator that is built with 3M quality and durable, intelligent construction. The Scotch TL901 laminating system laminates letter-size, legal-size, business-card size, photo-size and other papers up to 9 inches wide, your photographs and important documents along with dozens of other projects and crafts. Practical and fun, you can set it up anywhere and anytime. Protect your licenses, make luggage tags, preserve invitations, and create reusable menus, bookmarks, and gifts--you're limited only by your imagination. Plus, the Scotch TL901 laminating system is portable and lightweight (only 5.4 pounds), taking up just 9 inches of your valuable desk surface. Includes a jam release lever. What's in the Box: Laminator, two 11\" x 9.4\" double-sided lamination pouches, instructions, warranty information.\n\n\nLaminates items up to 9 inches wide\nTwo roller system with two temperature settings\nThe TL901 is designed to be used in a home or small office environment.We recommend only using the machine on 120V, 60Hz.\nWill laminate pouches up to 5 mil thick\nTwo 9.4\" x 11\" laminating pouches included\n\n\n\n \n\n\n\n\nDelivery & Shipping\n\n\nSHIPPING INFORMATION\n\n\nMost orders are shipped within one business day with standard shipping and tracking number. Tracking information will be automatically uploaded as soon as the item has been shipped. If you need your item even faster, we also offer 2-day and 1-day shipping options. Please make sure to provide the correct shipping address during checkout as the address cannot be changed after checkout. We are not responsible for any incorrect or undeliverable addresses. We do not ship to AK, HI, PO boxes, or APO addresses.\n\n\nFor additional information on shipping, please don't hesitate to contact us.\n\n\n\n\nPayment\n\n\nWe accept the following payment methods:\n\nPaypal\n\n\n\n\n\nReturns\n\n\n\nYou may return most new, unopened items within 30 days of delivery for a refund, we'll provide a prepaid return label for free. Items must be returned in the condition they arrived in. The box, UPC bar code, packaging, and all other accessories must be returned. Open software, music, games, movies, and personal hygiene products are not eligible for returns.\n\n\n\n\n\n\n\n\n\n\n\n", "mpn": "TL901", "brand": "Scotch", "url": "http://www.ebay.com/itm/Scotch-Thermal-Laminator-2-Roller-System-TL901-New-Free-Shipping-/261765811421?hash=item3cf2754cdd", "ebayID": "261765811421", "price": "39.51"}